Repository: fredricksimi/elandome-1
Catalog: locale/*/LC_MESSAGES/django.po
Languages: sw

source: Get to know about us and our journey.
sw: Jua kuhusu sisi na safari yetu.

source: Get acquainted with our team and understand how we work and proceed towards success.
sw: Fahamu timu yetu na uelewe jinsi tunavyofanya kazi na kuendelea kuelekeamafanikio.

source: About ELAN Dome Consultants
sw: Kuhusu ELAN Dome Consultants

source: ELAN (Education, Learning and Networking) Dome Consultants is an Africa based, bred and youth-led social & corporate outsourcing consultancy firm that strives to reshape the path of social service and international business engagements for students, individuals and institutions interested in integrating international experience and community service by offering high-quality international volunteer and service-learning engagements.
sw: ELAN (Education, Learning and Networking) Dome Consultants ni Msingi wa Afrika, uliokuzwa na kampuni ya ushauri ya kijamii na ushirika inayoongozwa na vijana ambayo inajitahidi kuunda upya njia ya kijamii huduma na shughuli za biashara za kimataifa kwa wanafunzi, watu binafsi na taasisi zinazovutiwa katika kuunganisha uzoefu wa kimataifa na huduma ya jamii kwa kutoa ubora wa kimataifa shughuli za kujitolea na mafunzo ya huduma.

source: Additionally, ELAN Dome Consultants offers supervision and implementation support services, organizational programming, project management, external quality assurance checks, curriculum research and development and international students collaboration projects. Our aim is to enhance impactful initiatives in Africa by promoting cultural exchange, reliable investment in projects and holistic learning for local citizens in the diaspora and the international community.
sw: Zaidi ya hayo, ELAN Dome Consultants inatoa usimamizi na utekelezaji wa huduma za usaidizi, programu ya shirika, usimamizi wa mradi, ubora wa nje ukaguzi wa uhakikisho, utafiti wa mitaala na miradi ya maendeleo na ushirikiano wa wanafunzi wa kimataifa. Lengo letu ni kuimarisha mipango yenye matokeo barani Afrika kwa kukuza ubadilishanaji wa kitamaduni, uwekezaji wa uhakika katika miradi na mafunzo ya jumla kwa wenyeji wananchi waliopo diaspora na jumuiya ya kimataifa.

source: Our Mission
sw: Dhamira Yetu

source: To match prospective individuals and institutions with communities and organizations through global networking and partnerships.
sw: Kuoanisha watu binafsi na taasisi watarajiwa na jamii na mashirika kupitia mitandao ya kimataifa na ushirikiano.

source: Our Vision
sw: Maono Yetu

source: Experiential learning beyond borders
sw: Mafunzo ya uzoefu nje ya mipaka

source: Client Focus Goal
sw: Lengo la Kuzingatia Mteja

source: Optimized logistical support, cultural experiences and fulfillment to the stakeholders.
sw: Usaidizi ulioboreshwa wa vifaa, uzoefu wa kitamaduni na utimilifu kwa wadau.

source: Primary Goal
sw: Lengo la Msingi

source: To facilitate a seamless and targeted positioning of individuals, families, groups and institutions in local but impactful initiatives in Africa.
sw: Ili kuwezesha nafasi isiyo na mshono na inayolengwa ya watu binafsi, familia, vikundi na taasisi katika mipango ya ndani lakini yenye matokeo barani Afrika.

source: Why Choose ELAN Dome Consultants
sw: Kwa nini Chagua Washauri wa ELAN Dome

source: Our efficient and experienced team members ensure that the journey of each participant turns out to be an incredible adventure.
sw: Washiriki wetu wa timu bora na wenye uzoefu wanahakikisha kwamba safari ya kila mmoja mshiriki anageuka kuwa adventure ya ajabu.

source: We offer a variety of programs tailored for diverse groups. The aim is to make a positive impact on the society and the participating individuals by instilling relevant skills and values.
sw: Tunatoa programu anuwai iliyoundwa kwa vikundi tofauti. Lengo ni ku kuleta matokeo chanya kwa jamii na washiriki watu binafsi kwa kuingiza husika ujuzi na maadili.

source: We have rolled out a localized integrated and dynamic international volunteer program for those seeking to experience Africa through service.
sw: Tumezindua kimataifa iliyojumuishwa iliyojumuishwa na yenye nguvu mpango wa kujitolea kwa wale wanaotaka kupata uzoefu wa Afrika kupitia huduma.

source: We look out for the best interests of our clients with our unmatched supervision and implementation support.
sw: Tunaangalia masilahi bora ya wateja wetu na yetu isiyo na kifani msaada wa usimamizi na utekelezaji.

source: We offer a variety of programs tailored for diverse groups. The aim is to make a positive impact on the society and the participating individuals by instilling relevant skills and values.
sw: Tunatoa mipango mbalimbali iliyoundwa kwa makundi mbalimbali. Lengo ni kuleta matokeo chanya kwa jamii na wanaoshiriki watu binafsi kwa kuingiza husika ujuzi na maadili.

source: Our Team of Experts
sw: Timu yetu ya Wataalam

source: Managing Director and Principal Consultant Partnerships and Corporate Affairs
sw: Mkurugenzi Mtendaji na Mshauri Mkuu Ubia na Masuala ya Biashara

source: Awino is a seasoned Operations Lead with over five (5) years' experience in fast-paced multi-sectoral organisations across multiple countries. She has excelled in providing strategic, quality assurance, administrative, logistical, coordination and implementation support to high-level executives and project teams with multiple tasks. She facilitates human centred design thinking and challenge driven education workshops for faculty, corporate staff and university students.
sw: Awino ni Kiongozi wa Operesheni aliyeboreshwa na zaidi ya watano (5) uzoefu wa miaka katika mwendo wa haraka mashirika ya sekta nyingi katika nchi nyingi. Amefanya vyema katika kutoa kimkakati, uhakikisho wa ubora, utawala, vifaa, uratibu na usaidizi wa utekelezaji kwa ngazi ya juu watendaji na timu za mradi zilizo na kazi nyingi. Yeye hurahisisha fikra za muundo unaozingatia binadamu na warsha zinazoendeshwa na changamoto za elimu kwa kitivo, wafanyakazi wa kampuni na wanafunzi wa chuo kikuu.

source: She has also negotiated for partnerships, developed proposals and instituted partner stewardship programs and has also been involved in data collection, classification, clean-up, knowledge management and governance for various organizations. Some of the organizations she has worked in include: the Judiciary, Strathmore University, Coalition of Blood for Africa, Pamoja CBO and ABE UK as an external quality assurer.
sw: Yeye pia mazungumzo kwa ajili ya ushirikiano, maendeleo mapendekezo na kuanzisha programu za uwakili wa washirika na pia amehusika katika ukusanyaji wa data, uainishaji, usafishaji, usimamizi wa maarifa na utawala kwa mashirika mbalimbali. Baadhi ya mashirika yeye amefanya kazi katika ni pamoja na: Mahakama, Strathmore Chuo Kikuu, Muungano wa Damu kwa Afrika, Pamoja CBO na ABE UK kama mdhamini wa ubora wa nje.

source: Director & Lead Consultant: Business Development, PR, Marketing & Communications
sw: Mkurugenzi na Mshauri Kiongozi: Maendeleo ya Biashara, PR, Masoko na Mawasiliano

source: Akinyi is a design savvy and goal oriented professional with over three (3) years experience working in the BPO industry in different capacities within communications departments. She is driven and motivated to enhance business growth and develop beneficial networks. She is highly creative and has an eye for aesthetics and visual presentation.
sw: Akinyi ni mtaalamu wa kubuni na mwenye mwelekeo wa malengo zaidi ya miaka mitatu (3) ya uzoefu wa kufanya kazi katika BPO katika nyanja mbalimbali za mawasiliano idara. Anasukumwa na kuhamasishwa kukuza biashara kukua na kuendeleza mitandao yenye manufaa. Yeye ni juu mbunifu na ana jicho la uzuri na uwasilishaji wa kuona.

source: She is passionate about streamlining processes through proper planning and execution and utilises her diverse design background and strong organisational skills to increase efficiency, profitability and make an impact in all her engagements. Akinyi graduated with a Bachelor's Degree in Design from the University of Nairobi and is also an honorary member of the Public Relations Society of Kenya whose mandate is to advance excellence in Public Relations and Communication Management in Kenya.
sw: Ana shauku ya kurahisisha michakato kupitia upangaji na utekelezaji sahihi na hutumia muundo wake tofauti usuli na ujuzi dhabiti wa shirika ili kuongeza ufanisi, faida na kuleta athari katika shughuli zake zote. Akinyi alihitimu Shahada ya Kwanza ya Usanifu katika Chuo cha Chuo Kikuu cha Nairobi na pia ni mwanachama wa heshima wa Umma Jumuiya ya Mahusiano ya Kenya ambayo mamlaka yake ni kuendeleza ubora katika Usimamizi wa Mahusiano ya Umma na Mawasiliano nchini Kenya.

source: Director & Lead Consultant: Operational Management, Finance and Administration
sw: Mkurugenzi & Mshauri Kiongozi: Usimamizi wa Uendeshaji, Fedha na Utawala

source: Judith is a finance and administration expert who is passionate about social impact. She has over 5 years experience in working with adolescent Girls and young women including youths and 3 years experience in leadership and management of community health programs.
sw: Judith ni mtaalam wa fedha na utawala ambaye ni shauku juu ya athari za kijamii. Ana zaidi ya miaka 5 uzoefu katika kufanya kazi na Wasichana waliobalehe na vijana wanawake wakiwemo vijana na uzoefu wa miaka 3 katika uongozi na usimamizi wa programu za afya ya jamii.

source: She has experience leading donor funded projects and is accountable for making decisions, managing resources efficiently, achieving and sustaining high performing teams while maintaining high ethical standards. She is very passionate about self development and personal growth. She loves working and mentoring the youths to learn thrive and lead in different capacities. She believes in mentorship and coaching to help the youth attain self actualization.
sw: Ana uzoefu wa kuongoza miradi inayofadhiliwa na wafadhili na yuko kuwajibika kwa kufanya maamuzi, kusimamia rasilimali kwa ufanisi, kufikia na kudumisha hali ya juu timu zinazocheza huku zikidumisha maadili ya hali ya juu viwango. Anapenda sana maendeleo ya kibinafsi na ya kibinafsi ukuaji. Anapenda kufanya kazi na kuwashauri vijana kujifunza kufanikiwa na kuongoza katika uwezo tofauti. Anaamini katika ushauri na kufundisha kusaidia vijana kupata uhalisia binafsi.

source: External Experts
sw: Wataalam wa Nje

source: Legal Advisory Consultant
sw: Mshauri wa Ushauri wa Kisheria

source: Wangari is a confident and meticulous advocate of the High Court of Kenya with professional experience in busy organisations such as the Kenya National Police Sacco and Equity Bank Kenya. She has also worked in reputable law firms like Mwandwa Macharia & Mwangi Co Advocates and Macharia Wa Muturi Co Advocates.
sw: Wangari ni mtetezi anayejiamini na makini wa Mahakama Kuu ya Kenya yenye taaluma uzoefu katika mashirika yenye shughuli nyingi kama vile Kenya National Police Sacco and Equity Bank Kenya. Pia amefanya kazi katika makampuni ya sheria yanayotambulika kama Mwandwa Macharia & Mwangi Co Advocates na Macharia Mawakili wa Wa Muturi Co.

source: Wangari is a mediator practising with The Judiciary of Kenya, an arbitrator and a member of the Chartered Institute of Arbitrator UK and Kenya. She strives to be a well-rounded advocate who can effectively handle diverse areas in the law, to develop a successful legal career founded on a good reputation, to be an exceptionally sensitive and dedicated advocate and to ensure that justice is served to each member of the society.
sw: Wangari ni mpatanishi anayefanya kazi na Mahakama ya Kenya, msuluhishi na mwanachama wa Chartered Taasisi ya Wasuluhishi Uingereza na Kenya. Anajitahidi kuwa wakili aliyekamilika ambaye anaweza kushughulikia kwa ufanisi maeneo mbalimbali katika sheria, ili kuendeleza kisheria yenye mafanikio kazi iliyojengwa juu ya sifa nzuri, kuwa wakili nyeti wa kipekee na aliyejitolea na kwa kuhakikisha haki inatendeka kwa kila mwanajamii.

source: Want to know more?
sw: Unataka kujua zaidi?

source: Visit our
sw: Tembelea

source: Get in touch with us. Our team is happy to help you to answer any questions you may have.
sw: Wasiliana nasi. Timu yetu inafurahi kukusaidia kujibu maswali yoyote unaweza kuwa nayo.

source: Talk to Us
sw: Zungumza Nasi

source: Get in touch with us. Our team is happy to help you to
sw: Wasiliana nasi. Timu yetu inafurahi kukusaidia

source: answer any questions you may have.
sw: kujibu maswali yoyote unaweza kuwa nayo.

source: Subscribe to our Newsletter
sw: Jiandikishe kwa Jarida letu

source: Subscribe to get more updates from us.
sw: Jiandikishe ili kupata sasisho zaidi kutoka kwetu.

source: Subscribe
sw: Jisajili

source: Fill the form below
sw: Jaza fomu hapa chini

source: Your names should match as they are in your passport.
sw: Majina yako yafanane kama yalivyo kwenye pasipoti yako.

source: First Name
sw: Jina la kwanza

source: Last Name
sw: Jina la familia

source: Preferred Name
sw: Jina Linalopendekezwa

source: Email
sw: Barua pepe

source: Street Address
sw: Anuani ya mtaa

source: City
sw: Jiji

source: Province
sw: Jimbo

source: Country of Origin
sw: Nchi ya asili

source: Home Phone
sw: Simu ya Nyumbani

source: Mobile Phone
sw: Simu ya rununu

source: Office Tel.
sw: Simu ya Ofisi.

source: Gender
sw: Jinsia

source: Date of Birth
sw: Tarehe ya kuzaliwa

source: Nationality
sw: Utaifa

source: Preferred Program
sw: Mpango Unaopendelea

source: Emergency Contact
sw: Tunayeweza wasiliana maneno ya Dharura

source: Full Name
sw: Jina kamili

source: Telephone No.
sw: Nambari ya simu

source: Residential Address
sw: Anwani ya Makazi

source: Relationship
sw: Uhusiano

source: Referee Contact
sw: Mawasiliano ya Mwamuzi

source: Organization
sw: Shirika

source: Work Address
sw: Anwani ya kazi

source: Your Education
sw: Elimu yako

source: Experience
sw: Uzoefu

source: Health conditions, disabilities e.t.c.
sw: Hali ya afya, ulemavu

source: Personalized Preferrences
sw: Mapendeleo Yanayobinafsishwa

source: Travel Pax
sw: Pax ya Kusafiri

source: Preferred Package
sw: Kifurushi Unachopendelea

source: Duration of stay
sw: Muda wa kukaa

source: Preferred City
sw: Jiji linalopendekezwa

source: When would you like to travel?
sw: Je, ungependa kusafiri lini?

source: Do you require further information?
sw: Je, unahitaji maelezo zaidi?

source: How did you hear about us?
sw: ulisikiaje kuhusu sisi?

source: Any other comments
sw: Maoni mengine yoyote

source: Submit
sw: Wasilisha

source: Contact Us
sw: Wasiliana nasi

source: FULL NAME
sw: JINA KAMILI

source: EMAIL
sw: BARUA PEPE

source: SUBJECT
sw: MADA

source: MESSAGE
sw: UJUMBE

source: How much time do I need to volunteer?
sw: Je, ninahitaji muda gani kujitolea?

source: ELAN Dome Consultants prides itself in creating volunteer schedules based on the desires of our clients. We offer volunteer opportunities for both short term and long term periods and this is left to the discretion of the volunteer. For instance, you can volunteer for a week, two weeks, a month and even a year.
sw: ELAN Dome Consultants inajivunia kuunda ratiba za kujitolea kulingana na matamanio ya wateja wetu. Tunatoa fursa za kujitolea kwa muda mfupi na mrefu na hii imeachwa kwa hiari ya kujitolea. Kwa mfano, unaweza kujitolea kwa a wiki, wiki mbili, mwezi na hata mwaka.

source: Will I get training before I volunteer?
sw: Je, nitapata mafunzo kabla ya kujitolea?

source: You will go through a very insightful orientation process for all the organizations and institutions that you volunteer in which will give you a better understanding of how they operate and how best to apply yourself.
sw: Utapitia ufahamu sana mchakato wa mwelekeo kwa mashirika yote na taasisi ambazo unajitolea katika mapenzi kukupa ufahamu bora wa jinsi wao kazi na jinsi bora ya kujituma.

source: How old do I have to be to volunteer?
sw: Je, ni lazima niwe na umri gani ili kujitolea?

source: We have no age limits for volunteering. Volunteers below the age of 18 will have to be accompanied by a parent or a guardian and have properly documented consent to participate in our various volunteer programs.
sw: Hatuna vikomo vya umri vya kujitolea. Wajitolea walio chini ya umri wa miaka 18 watalazimika kuwa akifuatana na mzazi au mlezi na kuwa na idhini iliyoandikwa ipasavyo kushiriki katika programu zetu mbalimbali za kujitolea.

source: Do I need qualifications?
sw: Je, ninahitaji sifa?

source: Some of our volunteering opportunities require qualifications. Our healthcare volunteer programs are fully based on our volunteers healthcare background and training for proper records of the same will have to be submitted to ensure effective placement. If particular qualifications are needed this will be stated in our pre engagement sessions.
sw: Baadhi ya fursa zetu za kujitolea zinahitaji sifa. Mhudumu wetu wa kujitolea wa afya mipango inategemea kikamilifu watu wetu wa kujitolea historia ya afya na mafunzo kwa sahihi kumbukumbu sawa itabidi kuwasilishwa kwa hakikisha uwekaji mzuri. Ikiwa maalum sifa zinahitajika hii itaelezwa katika vikao vyetu vya kabla ya uchumba.

source: Can I get a qualification or an award?
sw: Je, ninaweza kupata sifa au tuzo?

source: Our volunteers get several benefits from their volunteering journey ranging from a resume that stands out, transforming communities, exploring and cultivating interest areas, a safe and convenient way to travel abroad with adequate assistance and finally getting the opportunity to take on a new adventure. ELAN Dome also offers a valuable certificate of completion to all volunteers along with access to a wide network of volunteers, program coordinators, local organizations, and support staff.
sw: Watumishi wetu wa kujitolea hupata manufaa kadhaa kutoka kwao safari ya kujitolea kuanzia wasifu ambayo inajitokeza, kubadilisha jamii, kuchunguza na kukuza maeneo yenye maslahi, njia salama na rahisi ya kusafiri nje ya nchi kwa msaada wa kutosha na hatimaye kupata fursa ya kuchukua adventure mpya. ELAN Dome pia inatoa thamani cheti cha kukamilika kwa watu wote wa kujitolea pamoja na upatikanaji wa mtandao mpana wa watu wa kujitolea, waratibu wa programu, mashirika ya ndani, na wafanyakazi wa usaidizi.

source: What else can I do during my volunteering journey?
sw: Nini kingine ninaweza kufanya wakati wa safari yangu ya kujitolea?

source: Aside from volunteering and helping underserved communities, we create avenues where our volunteers can make more memories through leisure activities.Some of these activities include:
sw: Kando na kujitolea na kusaidia watu wasio na uwezo jamii, tunatengeneza njia ambapo yetu wanaojitolea wanaweza kutengeneza kumbukumbu zaidi kupitia shughuli za burudani.Baadhi ya shughuli hizi ni pamoja na:

source: Taking Weekend Trips (beach visits, hiking, camping)
sw: Kuchukua Safari za Wikendi (ziara za ufukweni, kupanda milima, kupiga kambi)

source: Sampling local cuisine
sw: Sampuli ya vyakula vya ndani

source: Safari drives in local game parks and reserves
sw: Safari huendesha katika mbuga za wanyama za ndani na hifadhi

source: How long do the workshops and trainings take?
sw: Warsha na mafunzo huchukua muda gani?

source: This is left to the discretion of the client. ELAN Dome is very passionate about tailor making the workshop and training program. We structure them after carefully understanding the needs of our clients so as to ensure that positive outcomes are realized.
sw: Hii imeachwa kwa hiari ya mteja. ELAN Dome anapenda sana ushonaji nguo kuandaa warsha na programu ya mafunzo. Sisi zitengeneze baada ya kuelewa kwa makini mahitaji ya wateja wetu ili kuhakikisha kwamba matokeo chanya yanapatikana.

source: How can I keep tabs on my investment?
sw: Je, ninawezaje kuendelea kufuatilia uwekezaji wangu?

source: ELAN Dome strives to enhance accountability and clarity for all our investment supervision activities. We make our clients part of the journey even when they are away in different countries so that at every particular juncture they are fully aware of what actions are being taken with regards to their investment.
sw: ELAN Dome inajitahidi kuimarisha uwajibikaji na uwazi kwa usimamizi wetu wote wa uwekezaji shughuli. Tunawafanya wateja wetu kuwa sehemu ya safari hata wakiwa mbali kwa tofauti nchi ili kwa kila mahususi wanafahamu kikamilifu ni vitendo gani vinafanyika kuchukuliwa kuhusiana na uwekezaji wao.

source: What project management approach do you use?
sw: Je, unatumia mbinu gani ya usimamizi wa mradi?

source: ELAN Dome's project management approaches are fully pegged and influenced by the kind of project we are tasked with at any given time. Please reach out to us about a specific project and we will be able to give a detailed overview of the approach
sw: Mbinu za usimamizi wa mradi wa ELAN Dome tumedhibitiwa kikamilifu na kusukumwa na aina ya mradi tulio nao kuwajibika kwa wakati wowote. Tafadhali fikia tuwasiliane kuhusu mradi fulani na tutaweza toa muhtasari wa kina wa mbinu hiyo

source: None of these FAQs answers my question, what do I do now?
sw: Hakuna Maswali Yanayoulizwa Mara kwa Mara kati ya haya yanayojibu swali langu, nifanye nini sasa?

source: If we haven't covered your question please get in touch with us through our email
sw: Ikiwa hatujashughulikia swali lako tafadhali wasiliana nasi kupitia yetu barua pepe

source: detailing your questions
sw: kufafanua maswali yako

source: and we'll be happy to help.
sw: na tutafurahi kusaidia.

source: 12th Floor
sw: Ghorofa ya 12

source: Phone
sw: Simu

source: Website
sw: Tovuti

source: Pay Us a Visit
sw: Tutembelee

source: All Rights Reserved.
sw: Haki zote zimehifadhiwa.

source: EDC Community
sw: Jumuiya ya EDC

source: Families
sw: Familia

source: Our family packages create an avenue for bonding with your loved ones, immersing your family in a different culture and giving back to communities.
sw: Vifurushi vyetu vya familia huunda njia ya kushikamana na yako wapendwa, kuzamishwa familia yako katika utamaduni tofauti na kutoa nyuma jumuiya.

source: Friends
sw: Marafiki

source: Our friends package takes buddies through an experience that strengthens friendships and transforms social lives for the better.
sw: Kifurushi chetu cha marafiki huwatumia marafiki kupitia uzoefu unaoimarisha urafiki na kubadilisha maisha ya kijamii kuwa bora.

source: Students
sw: Wanafunzi

source: This package takes students through an experiential journey of personal growth that enables them to develop new skills, acquire a global perspective, meet new people and even improve their career prospects
sw: Kifurushi hiki kinachukua wanafunzi kupitia safari ya uzoefu ukuaji wa kibinafsi unaowawezesha kukuza mpya ujuzi, kupata mtazamo wa kimataifa, kukutana na watu wapya na hata kuboresha matarajio yao ya kazi

source: Employees
sw: Wafanyakazi

source: Our employee program is a planned and managed initiative that seeks to motivate and enable employees to develop design thinking skills, increase employee engagement in problem solving and enhance employee retention through self leadership.
sw: Mpango wetu wa wafanyikazi ni mpango uliopangwa na unaosimamiwa ambayo inataka kuwahamasisha na kuwawezesha wafanyakazi kujiendeleza kubuni ujuzi wa kufikiri, kuongeza ushiriki wa mfanyakazi katika kutatua matatizo na kuboresha uhifadhi wa wafanyakazi kupitia uongozi binafsi.

source: Individuals
sw: Watu binafsi
