Repository: fredricksimi/elandome-1
Catalog: locale/*/LC_MESSAGES/django.po
Languages: sw

source: These workshops and training sessions focus on respective areas as requested by our clients. They range from personal development areas to professional improvement areas like leadership training and change management. They are particularly very beneficial to organizations that would like to optimize their manpower and create unison within different departments.
sw: Warsha hizi na vipindi vya mafunzo vinazingatia maeneo husika kama ilivyoombwa na wateja wetu. Zinaanzia maeneo ya maendeleo ya kibinafsi hadi maeneo ya kuboresha taaluma kama mafunzo ya uongozi na usimamizi wa mabadiliko. Wao ni hasa manufaa kwa mashirika ambayo yangependa kuongeza nguvu kazi yao idara.

source: We work with individuals to help them identify what's most important to them and what they want from their future and then support them to achieve these goals. Our Career Counseling program is beneficial in numerous ways.
sw: Tunafanya kazi na watu binafsi ili kuwasaidia kutambua kilicho zaidi muhimu kwao na nini wao wanataka kutoka kwa maisha yao ya baadaye na kuwaunga mkono kufikia malengo haya. Ushauri wetu wa Kazi programu ni ya manufaa kwa njia nyingi.

source: We help you fully explore your interests
sw: Tunakusaidia kuchunguza kikamilifu mambo yanayokuvutia

source: Through career counselling our participants are able to sift through factors that actually make them want a certain career and angle plus common influential factors. Our career counselors also question and support choices with all factors considered.
sw: Kupitia ushauri wa kazi washiriki wetu wanaweza kuchuja kupitia mambo ambayo kwa kweli hufanya wanataka taaluma na pembe fulani pamoja na ushawishi wa kawaida sababu. Washauri wetu wa taaluma pia swali na usaidizi wa chaguo na mambo yote kuzingatiwa.

source: We clarify your professional objectives.
sw: Tunafafanua malengo yako ya kitaaluma.

source: We help you expand your horizons.
sw: Tunakusaidia kupanua upeo wako.

source: Through our career counseling program you will gain a wider perspective of the career options and choices you have. You will be able to explore more career options, review the opportunities that present themselves and settle on the best fit.
sw: Kupitia programu yetu ya ushauri wa kazi utapata pana zaidi mtazamo wa chaguzi za kazi na chaguzi unazo. Utaweza kuchunguza zaidi chaguzi za kazi, kagua fursa wanaojiwasilisha na kukaa kwenye kifafa bora zaidi.

source: Still want to know more? Let's Talk
sw: Bado unataka kujua zaidi? Tuzungumze

source: Our
sw: Mchakato

source: Process
sw: Wetu

source: We prioritize efficient and seamless operations that cushion our clients from the hustle and bustle of international regulatory requirements, cultural pressures and international logistics. We transfer these responsibilities from you to us given our deep understanding of the cultural contexts, legal requirements and local dynamics. We want to make sure everything is fast, simple, under control, pleasant, experiential, memorable and impactful.
sw: Tunatanguliza utendakazi bora na usio na mshono ambao kuwaepusha wateja wetu kutokana na machafuko na zogo la mahitaji ya udhibiti wa kimataifa, shinikizo za kitamaduni na kimataifa vifaa. Tunahamisha majukumu haya kutoka kwako kwetu kutokana na ufahamu wetu wa kina ya muktadha wa kitamaduni, mahitaji ya kisheria na ya ndani mienendo. Tunataka kuhakikisha kila kitu ni haraka, rahisi, chini ya udhibiti, ya kupendeza, ya uzoefu, ya kukumbukwa na yenye athari.

source: What We Do
sw: Tunachofanya

source: Project focussed.
sw: Walengaji miradi

source: People centred.
sw: Watu kwanza.

source: Results driven.
sw: Waendeshaji matokeo.

source: Interlink international students, individual social/organizational groups, universities and boarding schools to prospective community programs, initiatives, organizations and projects.
sw: Interlink wanafunzi wa kimataifa, mtu binafsi kijamii/vikundi vya shirika, vyuo vikuu na shule za bweni kwa jamii inayotarajiwa mipango, mipango, mashirika na miradi.

source: Provide individuals with an experiential and international learning exposure service that is second to none in terms of immersion into societal contexts that are unique and rich.
sw: Kutoa watu binafsi na uzoefu na huduma ya kimataifa ya kufichua kujifunza ambayo ni ya pili kwa yeyote katika suala la kuzamishwa katika miktadha ya kijamii ambazo ni za kipekee na tajiri.

source: Offer project management services to in all aspects (community based organizations, corporate facing and event oriented)
sw: Toa huduma za usimamizi wa mradi kwa nyanja zote (mashirika ya kijamii, yanayokabili ushirika na inayolenga tukio)

source: Organize exceptional adventurous activities for volunteers across Africa- networking, thrill, food & culture etc.
sw: Organize exceptional adventurous activities for wafanyakazi wa kujitolea kote Afrika- mitandao, furaha, chakula na utamaduni nk.

source: Provide 360 placement services to assist interested individuals in all facets of enrolling in international internship and exchange programs.
sw: Toa huduma za uwekaji 360 ili kusaidia wanaovutiwa watu binafsi katika nyanja zote za kujiandikisha mipango ya kimataifa ya mafunzo na kubadilishana.

source: Provide organizational programming through the creation of functional organization designs, implementation, evaluation and support
sw: Kutoa programu za shirika kupitia kuunda miundo ya shirika inayofanya kazi, utekelezaji, tathmini na msaada

source: Our Portfolio
sw: Kwingineko yetu

source: The OBC volunteer program will help you render assistance to underprivileged and underserved communities where you will experience traditional cultures and even get a chance to interact with rich wildlife all while supporting a good cause and creating a positive impact in the society.
sw: Mpango wa OBC wa kujitolea utakusaidia kutoa usaidizi kwa jamii zisizo na uwezo na ambazo hazijahudumiwa pale utakapoweza uzoefu tamaduni za jadi na hata kupata nafasi ya kuingiliana na wanyamapori matajiri wakati wote wakiunga mkono sababu nzuri na kuunda chanya athari katika jamii.

source: Our areas of focus include: research, digitization, real estate & construction, corporate events (workshops and employee development programs), budgeting exercises and project fundraising initiatives.
sw: Maeneo yetu ya kuzingatia ni pamoja na: utafiti, digitalization, mali isiyohamishika na ujenzi, hafla za ushirika (warsha na wafanyikazi mipango ya maendeleo), mazoezi ya bajeti na uchangishaji fedha wa mradi mipango.

source: We walk with you the journey to discovering what sets your soul on fire professionally.
sw: We walk with you the journey to discovering what sets your soul on fire kitaaluma.

source: We help you develop skills that support your professional vision and ad-ons aimed at realizing your professional goals such as communication, ethics, personal presentation & profiling, international opportunities search criteria, preparation for the next level, value brnding per work outcome, knowing when to leave and winning negotiation skills for contracts.
sw: Tunakusaidia kukuza ujuzi unaokusaidia maono ya kitaaluma na matangazo yanayolenga kufikia malengo yako ya kitaaluma kama vile mawasiliano, maadili, uwasilishaji wa kibinafsi na wasifu, vigezo vya utafutaji wa fursa za kimataifa, maandalizi kwa kiwango kinachofuata, kuleta thamani kwa kila matokeo ya kazi, kujua wakati wa kuondoka na kushinda ujuzi wa mazungumzo mikataba.

source: Find Out More
sw: Jua Zaidi
