Repository: fredricksimi/elandome-1
Catalog: locale/*/LC_MESSAGES/django.po
Languages: sw

source: This package is designed for individuals looking to immerse themselves in a journey of self actualization and allows individuals to develop a deep understanding of the culture, community and country where they are volunteering, and they are highly rewarding.
sw: Kifurushi hiki kimeundwa kwa ajili ya watu binafsi wanaotaka kuzamishawenyewe katika safari ya kujitambua na kuwaruhusu watu binafsi kufanya hivyo kuendeleza kina ufahamu wa utamaduni, jamii na nchi ambapo wanajitolea, na wanathawabisha sana.

source: Teachers
sw: Walimu

source: The teachers' package allows teachers to bring their knowledge and skills to eager but underserved children. to help improve educational practices and processes.
sw: Kifurushi cha walimu kinaruhusu walimu kuleta maarifa na ujuzi wao watoto wenye hamu lakini wasio na uwezo. kusaidia kuboresha mazoea ya elimu na taratibu.

source: Be a part of our community
sw: Kuwa sehemu ya jamii yetu

source: Are you interested in joining our community as a volunteer, mentor or a partner?
sw: Je, ungependa kujiunga na jumuiya yetu kama mtu wa kujitolea, mshauri au mshirika?

source: Drop us an email at
sw: Tuandikie barua pepe kwa

source: we will send you more information and guide you through your journey with
sw: tutakutumia taarifa zaidi na kukuongoza katika safari yako na

source: Sign up today
sw: Jisajili leo

source: All Rights Reserved
sw: Haki zote zimehifadhiwa

source: ABOUT US
sw: KUHUSU SISI

source: How we run
sw: Jinsi tunavyoendesha

source: Structure and People
sw: Muundo na Watu

source: RESOURCES
sw: RASILIMALI

source: Media Center
sw: Kituo cha Media

source: Our Community
sw: Jumuiya Yetu

source: GET INVOLVED
sw: JIHUSISHE

source: Our Programs
sw: Mipango Yetu

source: Volunteer with Us
sw: Jitolee pamoja Nasi

source: LATEST
sw: KARIBUNI

source: WORK WITH US
sw: FANYA KAZI NASI

source: We integrate international experience, community service and supervision and implementation support to ensure that our clients get the best outcomes from our various programs
sw: Tunaunganisha uzoefu wa kimataifa, huduma za jamii na usimamizi na usaidizi wa utekelezaji ili kuhakikisha kuwa wateja wetu wanapata matokeo bora kutoka programu zetu mbalimbali

source: Our Gallery
sw: Picha Yetu

source: Our History
sw: Historia Yetu

source: Okore Booker Charles as a student at the Starehe Boys Center where values of impact creation and community service were inculcated
sw: Okore Booker Charles kama mwanafunzi katika Kituo cha Wavulana cha Starehe ambapo maadili ya uundaji wa athari na huduma za jamii ziliingizwa

source: ELAN (Education, Learning and Networking) Dome Consultants was incorporated under the efforts of three young, ambitious and human centred design driven ladies who were seeking to make empathy the key informant of design, decisions and solutions for people and businesses aimed at the progress of Africa.
sw: ELAN (Education, Learning and Networking) Dome Consultants ilijumuishwa chini ya juhudi za watatu vijana, kabambe na binadamu unaozingatia kubuni inaendeshwa wanawake ambao walikuwa wakitafuta kufanya huruma kuwa mtoa habari mkuu ya muundo, maamuzi na suluhisho kwa watu na biashara inayolenga maendeleo ya Afrika.

source: The founding partner of ELAN Dome draws deep inspiration from the intelligence, problem solving capability, mobilizing acumen and deep community service acts of her late father, Engineer Okore Booker Charles, OBC. He dedicated his life to fixing challenges, using his personal resources to support family, neighbours, friends, the community and strangers whenever he got the opportunity. He valued education, politics, farming, environmental preservation and human rights.
sw: Mshirika mwanzilishi wa ELAN Dome huchota msukumo wa kina kutoka kwa akili, uwezo wa kutatua shida, kuhamasisha acumen na matendo ya kina ya huduma kwa jamii marehemu baba, Mhandisi Okore Booker Charles, OBC. Yeye alijitolea maisha yake kutatua changamoto, kwa kutumia yake binafsi rasilimali za kusaidia familia, majirani, marafiki, jamii na wageni kila alipopata fursa. Alithamini elimu, siasa, kilimo, mazingira uhifadhi na haki za binadamu.

source: His main target groups were the elderly, the poor, orphans, girls of school going age and the oppressed in the society. He was an ardent believer in the law as an instrument of seeking justice and achieving balance in the society. He constantly stepped in to oversee his friends' projects and manage teams on their behalf whenever they were away on international engagements, having resigned on a voluntary basis to dedicate his life to service.
sw: Makundi yake makuu yalikuwa ni wazee, maskini, mayatima, wasichana wa umri wa kwenda shule na wanaokandamizwa katika jamii. Alikuwa muumini mkubwa wa sheria kama chombo cha kutafuta haki na kupata usawa katika jamii. Mara kwa mara aliingia kusimamia miradi ya marafiki zake na kusimamia timu kwa niaba yao wakati wowote walipokuwa ugenini juu ya shughuli za kimataifa, baada ya kujiuzulu kwa hiari msingi wa kujitolea maisha yake kwa huduma.

source: This organization is deeply rooted in his values of sincerity, service, smart work, advocacy, diligence, strategy, impact achievement and celebration. The dome signifies a sense of coming together in a community set up like traditional African families did. They would gather in groups to talk about their issues, find solutions, share meals, support each other and build relationships.
sw: Shirika hili limejikita sana katika maadili yake ya uaminifu, huduma, kazi nzuri, utetezi, bidii, mkakati, athari mafanikio na sherehe. Kuba inaashiria a hisia ya kuja pamoja katika jumuiya iliyoanzishwa kama familia za kitamaduni za Kiafrika zilifanya hivyo. Wangekusanyika vikundi kuzungumzia masuala yao, kutafuta suluhu, kushiriki milo, kusaidiana na kujenga mahusiano.

source: Engineer OBC had extensive networks and was able to strike new but formidable friendships by the first meeting, an attribute that resulted in his family receiving valuable support throughout his sickness, final demise and graceful send off. From this, the organization draws the value of networking, collaboration and cooperation in building functional ecosystems for individuals, groups and organizations.
sw: Mhandisi OBC alikuwa na mitandao mingi na aliweza kugoma urafiki mpya lakini wa kutisha na mkutano wa kwanza, sifa hiyo ilisababisha familia yake kupata usaidizi muhimu katika kipindi chote cha ugonjwa wake, kifo cha mwisho na kutuma kwa neema. Kutokana na hili, shirika huchota thamani ya mitandao, ushirikiano na ushirikiano katika kujenga mifumo ikolojia inayofanya kazi kwa watu binafsi, vikundi na mashirika.

source: Let's Talk
sw: Tuzungumze

source: Experiential Learning
sw: Kujifunza kwa Uzoefu

source: Beyond Borders.
sw: Nje ya Mipaka.

source: Experience adventure and learning concurrently through our personalized packages.
sw: Furahia matukio na kujifunza kwa wakati mmoja kupitia ubinafsi wetu vifurushi.

source: Get in touch - it's free
sw: Wasiliana nasi - ni bure

source: We're with you.
sw: Tuko pamoja nawe.

source: We are a goal oriented outsourcing consultancy firm that strives to optimize collaborative partnerships and provide carefully curated programs while stating result oriented.
sw: Sisi ni kampuni ya ushauri ya utoaji wa huduma za nje yenye malengo ambayo inajitahidi kuboresha ushirikiano shirikishi na kutoa mipango makini curated wakati kueleza matokeo yanayolengwa.

source: Our team is driven to do what's right and help you realize your vision. We believe in generating success collaboratively, delivering great results after every engagement, and building trust for the next big challenge.
sw: Timu yetu inasukumwa kufanya kile kilicho sawa na kukusaidia kutambua maono yako. Sisi amini katika kuzalisha mafanikio kwa ushirikiano, kutoa matokeo mazuri baada ya kila uchumba, na kujenga uaminifu kwa changamoto kubwa inayofuata.

source: Focus Areas
sw: Maeneo Makini

source: Volunteer Services
sw: Huduma za Kujitolea

source: The OBC volunteer program was created in honor of the Late Engineer Okore Booker Charles. This program has been carefully curated to reflect and inculcate the values that he lived by throughout his life in community service and social impact.
sw: Mpango wa kujitolea wa OBC uliundwa kwa heshima ya Marehemu Mhandisi Okore Booker Charles. Mpango huu umesimamiwa kwa uangalifu kwa kutafakari na kukazia maadili ambayo aliishi kwayo katika maisha yake yote katika huduma ya jamii na athari za kijamii.

source: The OBC volunteer program will help you render assistance to underprivileged and underserved communities where you will experience traditional cultures and even get a chance to interact with rich wildlife all while supporting a good cause and creating a positive impact in the society.
sw: Mpango wa OBC wa kujitolea utakusaidia kutoa usaidizi kwa jamii zisizo na uwezo na ambazo hazijahudumiwa pale utakapoweza uzoefu tamaduni za jadi na hata kupata nafasi ya kuingiliana na wanyamapori matajiri wakati wote wakiunga mkono sababu nzuri na kuunda chanya athari katika jamii.

source: Learn More
sw: Jua zaidi

source: We provide guidance and advice to individuals, groups and institutions about their investments and how to safeguard their interests and attain positive results. We further monitor the activities of these investments to ensure that there's full accountability and clarity on the utilisation of resources.
sw: Tunatoa mwongozo na ushauri kwa watu binafsi, vikundi na taasisi kuhusu uwekezaji wao na jinsi ya kulinda maslahi yao na kupata matokeo chanya. Tunafuatilia zaidi shughuli za uwekezaji huu ili kuhakikisha kuwa kuna uwajibikaji kamili na uwazi juu ya matumizi ya rasilimali.

source: Additionally, we advise organisations on key strategic issues by leveraging on our industry knowledge and analytical prowess to enable them make informed decisions. This service enables them to achieve their business objectives by capitalising on opportunities and being prepared to mitigate potential risks.
sw: Zaidi ya hayo, tunashauri mashirika juu ya mkakati muhimu masuala kwa kutumia maarifa ya tasnia yetu na uwezo wa uchambuzi ili kuwawezesha kufanya habari maamuzi. Huduma hii inawawezesha kufikia malengo yao malengo ya biashara kwa kutumia fursa na kuwa tayari kupunguza hatari zinazoweza kutokea.

source: SMEs, FMCG, Consulting firms, INGOs, not for profit organizations including CBOs, CSOs, FBOs, civil societies, government, academic institutions and individuals.
sw: SMEs, FMCG, Kampuni za Ushauri, INGOs, si za mashirika ya faida yakiwemo CBOs, CSOs, FBOs, jumuiya za kiraia, serikali, taasisi za kitaaluma na watu binafsi.

source: Project Management
sw: Usimamizi wa Mradi

source: We are the first choice custodians of your projects and resources on the ground. We source for quality and competitive resource plans, quotations, unique development plans and bespoke designs that are fairly priced and work with reputable experts to execute your vision and deliver beyond the expected outcomes.
sw: Sisi ndio wasimamizi chaguo la kwanza wa miradi na rasilimali zako kwenye ardhi. Tunapata mipango bora na ya ushindani ya rasilimali, nukuu, maendeleo ya kipekee mipango na miundo bespoke ambayo ni haki bei na fanya kazi na wataalam wanaoheshimika ili kutekeleza maono yako na kutoa zaidi ya matokeo yanayotarajiwa.

source: Our areas of focus include: research, digitization, real estate & construction, corporate events (workshops and employee development programs), budgeting exercises and project fundraising initiatives.
sw: Maeneo yetu ya kuzingatia ni pamoja na: utafiti, digitalization, mali isiyohamishika na ujenzi, hafla za ushirika (warsha na maendeleo ya wafanyikazi programu), mazoezi ya bajeti na mipango ya kukusanya fedha za mradi.

source: Workshops & Training
sw: Warsha na Mafunzo

source: We design, recruit, facilitate, assess, tailormake and report on extra ordinary workshops, team building and training initiatives for teams and organizations. Our primary focus is on:
sw: Tunatengeneza, kuajiri, kuwezesha, kutathmini, kutengeneza ushonaji na ripoti juu ya warsha za ziada za kawaida, ujenzi wa timu na mipango ya mafunzo kwa timu na mashirika. Lengo letu kuu ni:

source: Management i.e crisis management, change management, conflict management and overall team management.
sw: Usimamizi yaani usimamizi wa migogoro, usimamizi wa mabadiliko, udhibiti wa migogoro na usimamizi wa timu kwa ujumla.

source: Leadership i.e adaptable leadership, progressive organization culture, next level leadership, performance (financial & operational) and decision making analysis & design)
sw: Uongozi yaani uongozi unaobadilika, utamaduni wa shirika unaoendelea, unaofuata uongozi wa ngazi, utendaji (kifedha na kiutendaji) na uchambuzi wa maamuzi na kubuni)

source: Career Counselling
sw: Ushauri wa Kazi

source: We walk with you in the journey to discovering what sets your soul on fire professionally.
sw: Tunatembea nawe katika safari ya kugundua ni nini kinachoiweka roho yako moto kitaaluma.

source: We help you develop skills that support your professional vision and add-ons aimed at realizing your professional goals such as communication, ethics, personal presentation & profiling, international opportunities search criteria, preparation for the next level, value branding per work outcome, knowing when to leave and winning negotiation skills for contracts.
sw: Tunakusaidia kukuza ujuzi unaounga mkono maono yako ya kitaaluma na nyongeza inayolenga kufikia malengo yako ya kitaaluma kama vile mawasiliano, maadili, uwasilishaji wa kibinafsi na wasifu, vigezo vya utafutaji wa fursa za kimataifa, maandalizi kwa ngazi inayofuata, uwekaji chapa ya thamani kwa kila matokeo ya kazi, kujua wakati wa kuondoka na kushinda ujuzi wa mazungumzo mikataba.

source: The OBC volunteer program was created in honor of the Late Engineer Okore Booker Charles. This program has been carefully curated to reflect and inculcate the values that he lived by throughout his life in community service and social impact.
sw: Mpango wa OBC wa kujitolea uliundwa kwa heshima ya Marehemu Mhandisi Okore Charles booker. Mpango huu umewekwa kwa uangalifu kutafakari na kukazia maadili ambayo aliishi kwayo katika maisha yake yote katika huduma ya jamii na athari za kijamii.

source: The OBC volunteer program will help you render assistance to underprivileged and underserved communities where you will experience traditional cultures and even get a chance to interact with rich wildlife all while supporting a good cause and creating a positive impact in the society.
sw: Mpango wa OBC wa kujitolea utakusaidia kutoa usaidizi kwa wasiojiweza na jumuiya ambazo hazijahudumiwa ambapo utapata uzoefu tamaduni za jadi na hata kupata nafasi ya kuingiliana na wanyamapori matajiri wakati wote wakiunga mkono sababu nzuri na kuunda chanya athari katika jamii.

source: We provide guidance and advice to individuals, groups and institutions about their investments and how to safeguard their interests and attain positive results. We further monitor the activities of these investments to ensure that there's full accountability and clarity on the utilisation of resources.
sw: Tunatoa mwongozo na ushauri kwa watu binafsi, vikundi na taasisi kuhusu uwekezaji wao na jinsi ya kulinda maslahi yao na kupata matokeo chanya. Tunafuatilia zaidi shughuli za uwekezaji huu ili kuhakikisha kuwa kuna uwajibikaji kamili na uwazi juu ya matumizi ya rasilimali.

source: Our areas of focus include: research, digitization, real estate & construction, corporate events (workshops and employee development programs), budgeting exercises and project fundraising initiatives.
sw: Maeneo yetu ya kuzingatia ni pamoja na: utafiti, digitalization, halisi mali na ujenzi, hafla za ushirika (warsha na ukuzaji wa wafanyikazi programu), mazoezi ya bajeti na uchangishaji fedha wa mradi mipango.

source: Leadership i.e adaptable leadership, progressive organization culture, next level leadership, performance (financial & operational) and decision making analysis & design)
sw: Uongozi i.e uongozi unaobadilika, unaoendelea utamaduni wa shirika, uongozi wa ngazi inayofuata, utendaji (kifedha na kiutendaji) na uchambuzi wa maamuzi nakubuni)

source: We are all about accountability and convenience. Curious?
sw: Sote tunahusu uwajibikaji na urahisi. Unadadisi?

source: LET'S TALK
sw: TUZUNGUMZE

source: Home
sw: Nyumbani

source: Who We Are
sw: Sisi ni Nani

source: About Us
sw: Kuhusu sisi

source: Services
sw: Huduma

source: Programs
sw: Mipango

source: News
sw: Habari

source: Join Us
sw: Jiunge nasi

source: News Page
sw: Ukurasa wa Habari

source: The OBC Volunteer program is ideal for students and practitioners and aims to place enthusiastic volunteers in the right spaces to make a positive impact on the lives of underserved people within local African Communities. The OBC volunteers get to interact with the local communities and immerse themselves in rich African culture. Not only do they experience the fulfillment of making positive changes to these underprivileged communities, they also develop skills through a multicultural lens and a global spectrum.
sw: Mpango wa Kujitolea wa OBC ni bora kwa wanafunzi na watendaji na malengo ya kuweka wajitolea wenye shauku katika nafasi zinazofaa kufanya a athari chanya katika maisha ya watu wasio na huduma nzuri ndani ya Jumuiya za Kiafrika. OBC kujitolea kupata kuingiliana na jamii za wenyeji na kujitumbukiza katika matajiri wa Kiafrika utamaduni. Si wao tu uzoefu utimilifu wa kufanya mabadiliko chanya kwa jamii hizi zisizo na uwezo, pia wanakuza ujuzi kupitia lenzi ya tamaduni nyingi na a wigo wa kimataifa.

source: The OBC Volunteer program is open to individuals across the board from different backgrounds such as
sw: Mpango wa Kujitolea wa OBC uko wazi kwa watu binafsi kote kutoka asili tofauti kama vile

source: General Health Care
sw: Huduma ya Afya ya Jumla

source: Urban Planning and Development
sw: Mipango Miji na Maendeleo

source: Economic Empowerment
sw: Uwezeshaji Kiuchumi

source: Water and Sanitation
sw: Maji na Usafi wa Mazingira

source: Eco Farming
sw: Kilimo Eco

source: Mental Health
sw: Afya ya kiakili

source: Youth
sw: Vijana

source: Education
sw: Elimu

source: Child Care
sw: Huduma ya Mtoto

source: Elderly Care
sw: Huduma ya Wazee

source: We give our volunteers a detailed overview of ELAN Dome's volunteer missions and expectations to enable them to be confident and knowledgeable about the causes they are undertaking and to cultivate the motivation and enthusiasm that encouraged them to volunteer in the first place.
sw: Tunawapa wafanyakazi wetu wa kujitolea muhtasari wa kina wa ELAN Dome misheni ya kujitolea na matarajio ya kuwawezesha kujiamini na maarifa kuhusu sababu zao kufanya na kukuza hamasa na shauku hiyo kuwahimiza kujitolea mahali pa kwanza.

source: Apply to be a volunteer
sw: Omba kuwa mtu wa kujitolea

source: We support local citizens in the diaspora and international development organizations with all their investment needs. Using our knowledge about the local market we prioritize efficient and seamless operations that protect them from negative eventualities. Through our investment supervision services, we offer our local and international investor's representative service and supervision of their investment projects thereby enhancing accountability.
sw: Tunaunga mkono wananchi walioko ughaibuni na mashirika ya maendeleo ya kimataifa na uwekezaji wao wote mahitaji. Kwa kutumia ujuzi wetu kuhusu soko la ndani sisi weka kipaumbele utendakazi bora na usio na mshono unaolinda yao kutokana na matukio mabaya. Kupitia uwekezaji wetu huduma za usimamizi, tunatoa huduma zetu za ndani na international investor's representative service and usimamizi wa miradi yao ya uwekezaji na hivyo kuimarishwa uwajibikaji.

source: These services range from
sw: Huduma hizi zinaanzia

source: Supporting & managing the entire investment process.
sw: Kusaidia na kusimamia mchakato mzima wa uwekezaji.

source: Regularly inspecting investments sites in order to control the progress.
sw: Kukagua maeneo ya uwekezaji mara kwa mara ili kudhibiti maendeleo.

source: Verifying work carried out contractors.
sw: Kuhakiki kazi iliyofanywa na wakandarasi.

source: Generating post-completion documentation.
sw: Inazalisha hati za baada ya kukamilika.

source: Taking part in coordination meetings.
sw: Kushiriki katika mikutano ya uratibu.

source: Preparing and taking part in the final handover of the investment to the investor.
sw: Kuandaa na kushiriki katika makabidhiano ya mwisho ya uwekezaji kwa mwekezaji.

source: We make our clients part of the journey even while they are away by completely involving them in every juncture of our processes.
sw: Tunawafanya wateja wetu kuwa sehemu ya safari hata wakiwa mbali kuwashirikisha kabisa katika kila hatua ya michakato yetu.

source: We handle all aspects pertaining to the planning and execution of projects. We monitor projects through the stages of project initiation, planning, execution, and closure to make sure that the objectives of the project are fulfilled. We manage projects effectively so that they are completed on time, to the set specification and within the stipulated budgets. With our strong grasp of various modes of project delivery we can identify and recommend the most appropriate project delivery approach for projects.
sw: Tunashughulikia vipengele vyote vinavyohusu upangaji na utekelezaji wa miradi. Tunafuatilia miradi kupitia hatua za uanzishaji wa mradi, upangaji, utekelezaji, na kufungwa ili kuhakikisha kwamba malengo ya mradi yanatimia. Tunasimamia miradi kwa ufanisi ili zikamilike muda, kwa vipimo vilivyowekwa na ndani ya ilivyoainishwa bajeti. Pamoja na ufahamu wetu wa nguvu wa anuwai njia za utoaji wa mradi tunaweza kutambua na kupendekeza utoaji wa mradi unaofaa zaidi mbinu kwa ajili ya miradi.

source: Some of our project management services include
sw: Baadhi ya huduma zetu za usimamizi wa mradi ni pamoja na

source: Defining program goals and project scope
sw: Kufafanua malengo ya programu na upeo wa mradi

source: Identifying project delivery methods
sw: Utambuzi wa mbinu za utoaji wa mradi

source: Outlining project schedules
sw: Kuelezea ratiba za mradi

source: Cost management
sw: Usimamizi wa gharama

source: Developing and Evaluating proposals
sw: Kuendeleza na kutathmini mapendekezo

source: Managing Consulting Services
sw: Kusimamia Huduma za Ushauri

source: Developing Contract Documentation
sw: Kuendeleza Hati za Mkataba

source: Drafting and generating project reports
sw: Kuandaa na kutoa ripoti za mradi

source: Workshops provide an avenue to explore current topics, hands-on training, and practical application. ELAN Dome Consultants offers a wide array of interactive and dynamic workshops and training sessions that can be easily customized to suit different individuals, groups and organizations. (Corporate Organizations, Educational Institutions, NGOs, CBOs etc)
sw: Warsha hutoa njia ya kuchunguza mada za sasa, mafunzo ya vitendo, na matumizi ya vitendo. ELAN Dome Consultants hutoa safu nyingi za mwingiliano na warsha zenye nguvu na vipindi vya mafunzo ambavyo inaweza kubinafsishwa kwa urahisi ili kuendana na watu tofauti, vikundi na mashirika. (Shirika Mashirika, Taasisi za Elimu, NGOs, CBOs na kadhalika)
